RESULTS_BARE/http_100kb_bare_20251102-2234.txt
=== 2025-11-02 22:34:45 — workload=http_100kb env=bare run=1/7 ===
$ wrk -t4 -c128 -d60s http://192.168.1.149/100kb
Running 1m test @ http://192.168.1.149/100kb
  4 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   148.41ms  171.65ms   1.76s    94.79%
    Req/Sec   272.97     64.58   686.00     71.90%
  65397 requests in 1.04m, 6.26GB read
Requests/sec:   1046.11
Transfer/sec:    102.52MB
=== end ===