RESULTS_BARE/http_1kb_bare_20251102-1844.txt
=== 2025-11-02 18:44:02 — workload=http_1kb env=bare run=1/7 ===
$ wrk -t4 -c128 -d60s http://192.168.1.149/1kb
Running 1m test @ http://192.168.1.149/1kb
  4 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.77ms  144.75ms   1.33s    96.67%
    Req/Sec     5.07k   676.66    12.23k    87.77%
  1215539 requests in 1.04m, 1.46GB read
Requests/sec:  19400.38
Transfer/sec:     23.81MB
=== end ===