RESULTS_BARE/http_1kb_docker_20251102-2223.txt
=== 2025-11-02 22:23:23 — workload=http_1kb env=docker run=4/7 ===
$ wrk -t4 -c128 -d60s http://192.168.1.149/1kb
Running 1m test @ http://192.168.1.149/1kb
  4 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.38ms  188.03ms   1.63s    96.14%
    Req/Sec     4.11k   529.26     6.64k    88.59%
  983218 requests in 1.05m, 1.18GB read
Requests/sec:  15566.87
Transfer/sec:     19.11MB
=== end ===